---
kind: method
id: M:Autodesk.Revit.DB.ReferencePlane.Flip
source: html/1d78d335-f717-555d-e99f-f44e3d0376ce.htm
---
# Autodesk.Revit.DB.ReferencePlane.Flip Method

Flips the orientation of the reference plane.

## Syntax (C#)
```csharp
public void Flip()
```